import i18n from '@/utils/i18n'

export default i18n([
    ['数据元', '数据元', '数据元'],
    ['码表', '码表', '码表'],
    ['编码规则', '编码规则', '编码规则'],
    [
        '搜索${name}名称或英文名称',
        '搜索${name}名称或英文名称',
        '搜索${name}名称或英文名称',
    ],
    ['搜索${name}名称', '搜索${name}名称', '搜索${name}名称'],
    ['请选择${name}', '请选择${name}', '请选择${name}'],
    ['已选', '已选', '已选'],
    ['暂无数据', '暫無數據', 'No data'],
    ['暂无“${type}”的数据元'],
    ['暂无“${stdType}”的${dataType}'],
    ['可点击'],
    ['【新建】'],
    ['按钮创建该标准分类的数据元'],
    ['确定'],
    ['取消'],
    ['找不到？'],
    ['立即新建'],
    ['智能推荐'],
])
