import i18n from '@/utils/i18n'

export default i18n([
    ['搜索目录', '搜索目录', '搜索目录'],
    ['全部目录', '全部目录', '全部目录'],
    ['目录', '目录', '目录'],
    ['新建', '新建', '新建'],
    ['新建目录', '新建目录', '新建目录'],
    ['编辑', '编辑', '编辑'],
    ['编辑目录', '编辑目录', '编辑目录'],
    ['请输入目录名称', '请输入目录名称', '请输入目录名称'],
    ['确定', '确定', '确定'],
    ['刪除成功', '刪除成功', '刪除成功'],
    [
        '对不起，无法删除该目录',
        '对不起，无法删除该目录',
        '对不起，无法删除该目录',
    ],
    [
        '请先清空该目录下所有创建的数据记录，然后再尝试删除操作',
        '请先清空该目录下所有创建的数据记录，然后再尝试删除操作',
        '请先清空该目录下所有创建的数据记录，然后再尝试删除操作',
    ],
    ['搜索组织架构', '搜索组织架构', '搜索组织架构'],
])
