import { i18n } from '@/utils'

export default i18n([
    ['选择原子指标', '选择原子指标', '选择原子指标'],
    ['确定', '确定', '确定'],
    ['取消', '取消', '取消'],
    ['请选择所需原子指标', '请选择所需原子指标', '请选择所需原子指标'],
    ['未分组', '未分组', '未分组'],
    ['主题域', '主题域', '主题域'],
    ['组织架构', '组织架构', '组织架构'],
    ['搜索指标名称、编码', '搜索指标名称、编码', '搜索指标名称、编码'],
    [
        '按原子指标业务名称排序',
        '按原子指标业务名称排序',
        '按原子指标业务名称排序',
    ],
    [
        '按原子指标创建时间排序',
        '按原子指标创建时间排序',
        '按原子指标创建时间排序',
    ],
    [
        '按原子指标更新时间排序',
        '按原子指标更新时间排序',
        '按原子指标更新时间排序',
    ],
    [
        '搜索主题域分组、主题域、业务对象/活动',
        '搜索主题域分组、主题域、业务对象/活动',
        '搜索主题域分组、主题域、业务对象/活动',
    ],
    ['搜索指标名称、编码', '搜索指标名称、编码', '搜索指标名称、编码'],
    ['暂无数据', '暂无数据', '暂无数据'],
])
