import { i18n } from '@/utils'

export default i18n([
    ['按组织架构', '按组织架构', '按组织架构'],
    ['按业务领域', '按业务领域', '按业务领域'],
    ['业务标准表', '业务标准表', '业务标准表'],
    ['切换至', '切换至', '切换至'],
    ['组织', '组织', '组织'],
    ['部门', '部门', '部门'],
    ['主干业务', '主干业务', '主干业务'],
    ['业务模型', '业务模型', '业务模型'],
    ['信息目录', '信息目录', '信息目录'],
    ['数据目录', '数据目录', '数据目录'],
    ['业务领域', '业务领域', '业务领域'],

    ['取消收藏', '取消收藏', '取消收藏'],
    ['收藏成功', '收藏成功', '收藏成功'],
    ['取消收藏', '取消收藏', '取消收藏'],
    ['收藏', '收藏', '收藏'],
    ['共享申请', '共享申请', '共享申请'],
    ['加入共享清单', '加入共享清单', '加入共享清单'],
    ['反馈', '反馈', '反馈'],
    ['操作', '操作', '操作'],
])
