import { i18n } from '@/utils'

export default i18n([
    ['暂无数据', '暫無數據', 'No data'],
    ['请输入', '请输入', '请输入'],
    ['请选择', '请选择', '请选择'],
    ['请输入关键字', '请输入关键字', '请输入关键字'],
    ['筛选', '筛选', '筛选'],
    ['收起筛选', '收起筛选', '收起筛选'],
    ['取消筛选', '取消筛选', '取消筛选'],
    ['清除并收起筛选', '清除并收起筛选', '清除并收起筛选'],
    ['刷新', '刷新', '刷新'],
    ['重置', '重置', '重置'],
    ['查询', '查询', '查询'],
    ['收起', '收起', '收起'],
    ['展开', '展开', '展开'],
    ['开始时间'],
    ['结束时间'],
    ['搜索'],
    ['筛选条件：'],
    ['清除条件'],
    ['关闭'],
    ['至'],
])
