import { i18n } from '@/utils'

export default i18n([
    ['待执行', '待执行', '待执行'],

    ['状态不限', '状态不限', '状态不限'],
    ['不限', '不限', '不限'],
    ['已完成', '已完成', '已完成'],
    ['未完成', '未完成', '未完成'],

    [
        '搜索中英文名称、来源字段名称',
        '搜索中英文名称、来源字段名称',
        '搜索中英文名称、来源字段名称',
    ],
    ['新建标准'],

    ['搜索业务表名称', '搜索业务表名称', '搜索业务表名称'],
    [
        '需配置“${type}”的数据元',
        '需配置“${type}”的数据元',
        '需配置“${type}”的数据元',
    ],
    ['需配置', '需配置', '需配置'],
    ['的数据元', '的数据元', '的数据元'],
    ['“${type}”', '“${type}”', '“${type}”'],
    ['进度：', '进度：', '进度：'],

    ['原始字段名称', '原始字段名称', '原始字段名称'],
    ['字段说明', '字段说明', '字段说明'],
    ['数据元', '数据元', '数据元'],
    ['状态', '状态', '状态'],
    ['查看', '查看', '查看'],

    ['选择更多', '选择更多', '选择更多'],
    [
        '抱歉，没有找到相关内容',
        '抱歉，沒有找到相關內容',
        'Sorry, no relevant results found.',
    ],
    ['暂无数据', '暫無數據', 'No data'],
    ['新建', '新建', '新建'],
    ['搜索原始字段名称', '搜索原始字段名称', '搜索原始字段名称'],
    ['搜索数据元中英文名称', '搜索数据元中英文名称', '搜索数据元中英文名称'],
])
