import { i18n } from '@/utils'

export default i18n([
    ['选择库表', '选择库表', '选择库表'],
    ['确定', '确定', '确定'],
    ['取消', '取消', '取消'],
    ['请选择所需库表', '请选择所需库表', '请选择所需库表'],
    ['未分组', '未分组', '未分组'],
    ['主题域', '主题域', '主题域'],
    ['组织架构', '组织架构', '组织架构'],
    ['数据源分类', '数据源分类', '数据源分类'],
    [
        '搜索库表业务名称、技术名称、编码',
        '搜索库表业务名称、技术名称、编码',
        '搜索库表业务名称、技术名称、编码',
    ],
    ['按库表业务名称排序', '按库表业务名称排序', '按库表业务名称排序'],
    ['按库表创建时间排序', '按库表创建时间排序', '按库表创建时间排序'],
    ['按库表更新时间排序', '按库表更新时间排序', '按库表更新时间排序'],
    [
        '搜索业务对象分组、业务对象或逻辑实体',
        '搜索业务对象分组、业务对象或逻辑实体',
        '搜索业务对象分组、业务对象或逻辑实体',
    ],
    [
        '仅为您提供“已发布”的库表进行选择',
        '仅为您提供“已发布”的库表进行选择',
        '仅为您提供“已发布”的库表进行选择',
    ],
    ['业务对象'],
])
