import { i18n } from '@/utils'

export default i18n([
    ['数据资源目录', '数据资源目录', '数据资源目录'],
    ['库表上线', '库表上线', '库表上线'],
    ['库表', '库表', '库表'],
    ['接口管理', '接口管理', '接口管理'],
    ['资源权限申请', '资源权限申请', '资源权限申请'],
    ['信息资源目录', '信息资源目录', '信息资源目录'],
    ['上线审核流程：', '上线审核流程：', '上线审核流程：'],
    ['请选择审核流程', '请选择审核流程', '请选择审核流程'],
    ['保存', '保存', '保存'],
    ['取消', '取消', '取消'],
    ['未找到匹配的结果', '未找到匹配的结果', '未找到匹配的结果'],
    ['暂无数据', '暫無數據', 'No data'],
    ['已被删除，请重新选择', '已被删除，请重新选择', '已被删除，请重新选择'],
    ['申请下载流程：', '申请下载流程：', '申请下载流程：'],
    ['请选择申请下载流程', '请选择申请下载流程', '请选择申请下载流程'],
    ['数据需求', '数据需求', '数据需求'],
    [
        '数据需求分析审核流程：',
        '数据需求分析审核流程：',
        '数据需求分析审核流程：',
    ],
    [
        '数据需求资源Owner审核流程：',
        '数据需求资源Owner审核流程：',
        '数据需求资源Owner审核流程：',
    ],
    ['设置', '设置', '设置'],
    ['编辑', '编辑', '编辑'],
    ['解绑', '解绑', '解绑'],
    ['发布审核流程：', '发布审核流程：', '发布审核流程：'],
    ['下线审核流程：', '下线审核流程：', '下线审核流程：'],
    ['你确定要解绑吗?', '你确定要解绑吗?', '你确定要解绑吗?'],
    ['确定', '确定', '确定'],
    ['接口服务发布审核流程：'],
    ['接口服务上线审核流程：'],
    ['接口服务下线审核流程：'],
    ['接口调用申请审核流程：'],

    ['发布及变更审核'],
    ['上线审核'],
    ['下线审核'],
    [
        '设置后，用户发布数据表库表及变更审核时需要审核，审核通过后数据表库表发布或变更审核才生效；若未设置，默认自动通过无需审核',
    ],
    ['数据需求方案审核'],
    [
        '设置后，用户提交需求分析确认时需要审核，审核通过后需求分析可提交成功；若未设置，默认自动通过无需审核',
    ],
    [
        '设置后，用户申请资源权限时需要审核，审核通过后资源权限可申请成功；若未设置，则不提供给用户申请权限功能',
    ],
    ['若解绑，用户申请权限的功能不再提供给用户，其无法申请资源权限'],
    [
        '设置后，用户发布接口及变更时需要审核，审核通过后接口发布才生效；若未设置，默认自动通过无需审核',
    ],
    [
        '设置后，用户发布数据目录及变更审核时需要审核，审核通过后数据目录发布或变更审核才生效；若未设置，默认自动通过无需审核',
    ],
    [
        '设置后，用户上线数据目录时需要审核，审核通过后数据目录发布或变更审核才生效；若未设置，默认自动通过无需审核',
    ],
    [
        '设置后，用户下线数据目录时需要审核，审核通过后数据目录下线才生效；若未设置，默认自动通过无需审核',
    ],
    [
        '设置后，用户变更数据目录时需要审核，审核通过后数据目录变更才生效；若未设置，默认自动通过无需审核',
    ],

    [
        '设置审核流程后，用户发布接口时需要审核，审核通过后接口可发布成功；若未设置审核流程，默认自动通过无需审核',
        '设置审核流程后，用户发布接口时需要审核，审核通过后接口可发布成功；若未设置审核流程，默认自动通过无需审核',
        '设置审核流程后，用户发布接口时需要审核，审核通过后接口可发布成功；若未设置审核流程，默认自动通过无需审核',
    ],
    [
        '设置审核流程后，用户变更已发布的接口时需要审核，审核通过后接口可变更成功；若未设置审核流程，默认自动通过无需审核',
        '设置审核流程后，用户变更已发布的接口时需要审核，审核通过后接口可变更成功；若未设置审核流程，默认自动通过无需审核',
        '设置审核流程后，用户变更已发布的接口时需要审核，审核通过后接口可变更成功；若未设置审核流程，默认自动通过无需审核',
    ],
    [
        '设置审核流程后，用户上线接口时需要审核，审核通过后接口可上线成功；若未设置审核流程，默认自动通过无需审核',
        '设置审核流程后，用户上线接口时需要审核，审核通过后接口可上线成功；若未设置审核流程，默认自动通过无需审核',
        '设置审核流程后，用户上线接口时需要审核，审核通过后接口可上线成功；若未设置审核流程，默认自动通过无需审核',
    ],
    [
        '设置审核流程后，用户下线接口时需要审核，审核通过后接口可下线成功；若未设置审核流程，默认自动通过无需审核',
        '设置审核流程后，用户下线接口时需要审核，审核通过后接口可下线成功；若未设置审核流程，默认自动通过无需审核',
        '设置审核流程后，用户下线接口时需要审核，审核通过后接口可下线成功；若未设置审核流程，默认自动通过无需审核',
    ],
    ['发布审核'],
    ['变更审核'],
    ['确认解绑'],
    ['确定'],
    ['取消'],
    ['解绑成功'],
    ['确认要解绑该流程吗？'],
    [
        '设置后，用户发布${type}时需要审核，审核通过后${type}发布才生效；若未设置，默认自动通过无需审核',
    ],
    [
        '设置后，用户${type}变更时需要审核，审核通过后变更${type}才生效；若未设置，默认自动通过无需审核',
    ],
    [
        '设置后，用户上线${type}时需要审核，审核通过后${type}发布或变更审核才生效；若未设置，默认自动通过无需审核',
    ],
    [
        '设置后，用户下线${type}时需要审核，审核通过后${type}下线才生效；若未设置，默认自动通过无需审核',
    ],
    ['应用案例上报'],
    [
        '设置审核流程后，用户申请应用案例上报时需要本市州审核，审核通过后可上报到省平台；若未设置审核流程，默认自动通过无需审核',
    ],
    ['应用案例下架'],
    [
        '设置审核流程后，用户申请应用案例下架时需要本市州审核，审核通过后可从省平台下架；若未设置审核流程，默认自动通过无需审核',
    ],
    ['省级需求申请'],
    [
        '设置审核流程后，用户申请省级需求时需要本市州审核，审核通过后可上报到省平台；若未设置审核流程，默认自动通过无需审核',
    ],
    ['资源申请发起审核'],
    ['资源共享处理审核'],
    [
        '设置审核流程后，用户申请省级数据时需要本市州审核，审核通过后可上报到省平台；若未设置审核流程，默认自动通过无需审核',
    ],
    [
        '设置审核流程后，用户进行资源共享处理时需要审核，审核通过后可反馈结果到省平台；若未设置审核流程，默认自动通过无需审核',
    ],
    ['目录上报申请'],
    ['资源上报申请'],
    [
        '设置审核流程后，用户申请省级数据时需要本州市审核，审核通过后可上报到省平台；若未设置审核流程，默认自动通过无需审核',
    ],
    ['标签管理', '标签管理', '标签管理'],
    ['授权审核', '授权审核', '授权审核'],
    ['删除审核', '删除审核', '删除审核'],
    [
        '设置后，用户发布标签需要审核，审核通过后标签才生效；若未设置，默认自动通过无需审核',
        '设置后，用户发布标签需要审核，审核通过后标签才生效；若未设置，默认自动通过无需审核',
        '设置后，用户发布标签需要审核，审核通过后标签才生效；若未设置，默认自动通过无需审核',
    ],
    [
        '设置后，用户变更标签时需要审核，审核通过后标签才生效；若未设置，默认自动通过无需审核',
        '设置后，用户变更标签时需要审核，审核通过后标签才生效；若未设置，默认自动通过无需审核',
        '设置后，用户变更标签时需要审核，审核通过后标签才生效；若未设置，默认自动通过无需审核',
    ],
    [
        '设置后，用户删除标签时需要审核，审核通过后标签删除才生效；若未设置，默认自动通过无需审核',
        '设置后，用户删除标签时需要审核，审核通过后标签删除才生效；若未设置，默认自动通过无需审核',
        '设置后，用户删除标签时需要审核，审核通过后标签删除才生效；若未设置，默认自动通过无需审核',
    ],
    [
        '设置后，用户授权标签时需要审核，审核通过后标签授权才生效；若未设置，默认自动通过无需审核',
        '设置后，用户授权标签时需要审核，审核通过后标签授权才生效；若未设置，默认自动通过无需审核',
        '设置后，用户授权标签时需要审核，审核通过后标签授权才生效；若未设置，默认自动通过无需审核',
    ],
    ['数据异议申请', '数据异议申请', '数据异议申请'],
    [
        '设置审核流程后，用户申请需部门负责人审核；若未设置审核流程，默认自动通过无需审核',
        '设置审核流程后，用户申请需部门负责人审核；若未设置审核流程，默认自动通过无需审核',
        '设置审核流程后，用户申请需部门负责人审核；若未设置审核流程，默认自动通过无需审核',
    ],
    [
        '设置审核流程后，运营人员分析后需市数据局审核；若未设置审核流程，默认自动通过无需审核',
        '设置审核流程后，运营人员分析后需市数据局审核；若未设置审核流程，默认自动通过无需审核',
        '设置审核流程后，运营人员分析后需市数据局审核；若未设置审核流程，默认自动通过无需审核',
    ],
    ['供需申报'],
    ['供需分析'],
    ['市州供需对接'],
    ['数据归集计划', '数据归集计划', '数据归集计划'],
    [
        '设置审核流程后，用户创建的数据归集计划通过审核后才会生效；若未设置审核流程，默认自动通过无需审核',
        '设置审核流程后，用户创建的数据归集计划通过审核后才会生效；若未设置审核流程，默认自动通过无需审核',
        '设置审核流程后，用户创建的数据归集计划通过审核后才会生效；若未设置审核流程，默认自动通过无需审核',
    ],
    ['数据归集清单', '数据归集清单', '数据归集清单'],
    [
        '设置审核流程后，用户创建的数据归集清单通过审核后才会生效；若未设置审核流程，默认自动通过无需审核',
        '设置审核流程后，用户创建的数据归集清单通过审核后才会生效；若未设置审核流程，默认自动通过无需审核',
        '设置审核流程后，用户创建的数据归集清单通过审核后才会生效；若未设置审核流程，默认自动通过无需审核',
    ],
    ['数据处理计划', '数据处理计划', '数据处理计划'],
    [
        '设置审核流程后，用户创建的数据处理计划通过审核后才会生效；若未设置审核流程，默认自动通过无需审核',
        '设置审核流程后，用户创建的数据处理计划通过审核后才会生效；若未设置审核流程，默认自动通过无需审核',
        '设置审核流程后，用户创建的数据处理计划通过审核后才会生效；若未设置审核流程，默认自动通过无需审核',
    ],
    ['数据理解计划', '数据理解计划', '数据理解计划'],
    [
        '设置审核流程后，用户创建的数据理解计划通过审核后才会生效；若未设置审核流程，默认自动通过无需审核',
        '设置审核流程后，用户创建的数据理解计划通过审核后才会生效；若未设置审核流程，默认自动通过无需审核',
        '设置审核流程后，用户创建的数据理解计划通过审核后才会生效；若未设置审核流程，默认自动通过无需审核',
    ],
    ['数据理解报告'],
    [
        '设置后，用户提交数据理解报告时需要审核，审核通过后数据理解报告可生成成功；若未设置，默认自动通过无需审核',
    ],
    ['调研报告', '调研报告', '调研报告'],
    ['文件资源', '文件资源', '文件资源'],
    [
        '设置审核流程后，用户创建的数据调研报告通过审核后才会生效；若未设置审核流程，默认自动通过无需审核',
        '设置审核流程后，用户创建的数据调研报告通过审核后才会生效；若未设置审核流程，默认自动通过无需审核',
        '设置审核流程后，用户创建的数据调研报告通过审核后才会生效；若未设置审核流程，默认自动通过无需审核',
    ],
    ['前置机申请'],
    [
        '设置审核流程后，通过审核的申请单才可以分配前置机；若未设置审核流程，默认自动通过无需审核',
    ],
    ['应用申请', '应用申请', '应用申请'],
    ['应用上报申请', '应用上报申请', '应用上报申请'],
    [
        '设置审核流程后，用户申请应用上报时需要本市州审核，审核通过后可上报到省平台；若未设置审核流程，默认自动通过无需审核',
        '设置审核流程后，用户申请应用上报时需要本市州审核，审核通过后可上报到省平台；若未设置审核流程，默认自动通过无需审核',
        '设置审核流程后，用户申请应用上报时需要本市州审核，审核通过后可上报到省平台；若未设置审核流程，默认自动通过无需审核',
    ],
    [
        '设置审核流程后，用户申请应用上报时需要本市州审核，审核通过后可上报到省平台；若未设置审核流程，默认自动通过无需审核',
        '设置审核流程后，用户申请应用上报时需要本市州审核，审核通过后可上报到省平台；若未设置审核流程，默认自动通过无需审核',
        '设置审核流程后，用户申请应用上报时需要本市州审核，审核通过后可上报到省平台；若未设置审核流程，默认自动通过无需审核',
    ],
    ['开放目录申请'],
    [
        '设置审核流程后，通过审核的目录会同步展示在共享开放平台；若未设置，默认自动通过无需审核',
    ],
    ['数据理解'],
    ['数据归集'],
    ['${type}工单'],
    [
        '设置审核流程后，用户创建的${type}工单通过审核后才会生效；若未设置审核流程，默认自动通过无需审核',
    ],
    ['标准化工单'],
    [
        '设置审核流程后，用户创建的工单通过审核后才会生效；若未设置审核流程，默认自动通过无需审核',
    ],
    [
        '设置审核流程后，文件审核后才会发布；若未设置审核流程，默认自动发布无需审核',
    ],
    ['数据融合工单'],
    ['租户申请', '租户申请', '租户申请'],
    [
        '设置审核流程后，用户创建的租户申请通过审核后才会生效；若未设置审核流程，默认自动通过无需审核',
        '设置审核流程后，用户创建的租户申请通过审核后才会生效；若未设置审核流程，默认自动通过无需审核',
        '设置审核流程后，用户创建的租户申请通过审核后才会生效；若未设置审核流程，默认自动通过无需审核',
    ],
    ['市州共享申请', '市州共享申请', '市州共享申请'],
    ['申报审核', '申报审核', '申报审核'],
    ['分析结论审核', '分析结论审核', '分析结论审核'],
    [
        '设置后，用户发起共享申请时需要审核，审核通过后申请才通过；若未设置，默认自动通过无需审核',
    ],
    [
        '设置后，用户提交分析结论时需要审核，审核通过后申请才通过；若未设置，默认自动通过无需审核',
    ],
    ['数据推送申请', '数据推送申请', '数据推送申请'],
    ['业务领域'],
    ['主干业务'],
    ['业务诊断'],
    [
        '用户新建业务领域及变更时需要审核，审核通过后业务领域新建或变更才生效；若未设置，默认自动通过无需审核',
    ],
    [
        '用户删除业务领域时需要审核，审核通过后业务领域删除才生效；若未设置，默认自动通过无需审核',
    ],
    [
        '新生成诊断报告时需要审核，审核通过后诊断报告才生效；若未设置，默认自动通过无需审核',
    ],
    [
        '用户新建主干业务及变更时需要审核，审核通过后主干业务新建或变更才生效;若未设置，默认自动通过无需审核',
    ],
    [
        '设置后，用户发布、变更、停用、启用数据推送需要审核，审核通过后数据推送才生效；若未设置，默认自动通过无需审核',
    ],
    ['文件资源'],
    ['数据归集工单'],
    [
        '设置审核流程后，用户创建的数据归集工单通过审核后才会生效；若未设置审核流程，默认自动通过无需审核',
    ],
    [
        '设置审核流程后，文件审核后才会发布；若未设置审核流程，默认自动发布无需审核；若未设置，默认自动通过无需审核',
    ],
    ['业务模型'],
    [
        '用户新建业务模型及变更时需要审核，审核通过后业务模型新建或变更才生效；若未设置，默认自动通过无需审核',
    ],
    ['数据质量整改'],
    [
        '设置审核流程后，用户创建的工单通过审核后才会生效；若未设置审核流程，默认自动通过无需审核',
    ],
    ['质量检测工单'],
    ['数据分析需求申请'],
    [
        '设置审核流程后，用户申报的需求通过审核后才会生效；若未设置，默认自动通过无需审核',
    ],
    ['数据分析方案'],
    [
        '设置审核流程后，需求分析方案通过审核后才会生效；若未设置，默认自动通过无需审核',
    ],
    ['数据模型'],
    [
        '用户新建数据模型及变更时需要审核，审核通过后数据模型新建或变更才生效；若未设置，默认自动通过无需审核',
    ],
    ['数据沙箱'],
    ['申请审核'],
    ['扩容审核'],
    [
        '设置审核流程后，用户申请沙箱时需要审核，审核通过后沙箱申请成功;若未设置审核流程，默认自动通过无需审核',
    ],
    [
        '设置审核流程后，用户扩容沙箱时需要审核，审核通过后沙箱扩容成功;若未设置审核流程，默认自动通过无需审核',
    ],
    [
        '设置审核流程后，用户变更信息资源目录时需要审核，审核通过后可变更信息资源目录；若未设置审核流程，默认自动通过无需审核',
    ],
    ['成效反馈'],
    [
        '设置审核流程后，申请者反馈的结果通过审核后才会生效；若未设置审核流程，默认自动通过无需审核',
    ],
    ['分析成果出库申请'],
    [
        '设置审核流程后，用户申请分析成果出库时需要审核，审核通过后可出库；若未设置审核流程，默认自动通过无需审核',
    ],
    ['数据分析需求成效反馈'],
    [
        '设置审核流程后，用户创建的应用通过审核后才会生效；若未设置审核流程，默认自动通过无需审核。',
    ],
    ['市级共享申请成效反馈'],
    [
        '设置审核流程后，用户创建的${type}通过审核后才会生效；若未设置审核流程，默认自动通过无需审核',
    ],
    ['资源编目工单'],
    ['前置机申请工单'],
    ['调研工单'],
    ['数仓库表权限申请'],
    [
        '设置后，用户申请数仓库表权限时需要审核，审核通过后可申请成功；若未设置，用户将无法创建数仓库表的权限申请',
    ],
])
