import { i18n } from '@/utils'

export default i18n([
    [
        '搜索目录名称、业务模型、主干业务、组织机构、标签',
        '搜索目录名称、业务模型、主干业务、组织机构、标签',
        '搜索目录名称、业务模型、主干业务、组织机构、标签',
    ],
    [
        '搜索目录名称、业务模型、主干业务、业务领域、标签',
        '搜索目录名称、业务模型、主干业务、业务领域、标签',
        '搜索目录名称、业务模型、主干业务、业务领域、标签',
    ],
    ['搜索结果（${text}）', '搜索结果（${text}）', '搜索结果（${text}）'],
    ['全部', '全部', '全部'],
    ['数据目录', '数据目录', '数据目录'],
    ['信息目录', '信息目录', '信息目录'],
    ['业务模型', '业务模型', '业务模型'],
    ['主干业务', '主干业务', '主干业务'],
    ['组织机构', '组织机构', '组织机构'],
    ['收起', '收起', '收起'],
    ['未搜索到内容', '未搜索到内容', '未搜索到内容'],
    ['暂无数据', '暫無數據', 'No data'],
    ['路径：', '路径：', '路径：'],
    ['标签：', '标签：', '标签：'],
])
