import { i18n } from '@/utils'

export default i18n([
    ['组织架构', '组织架构', '组织架构'],
    ['主干业务', '主干业务', '主干业务'],
    ['信息系统', '信息系统', '信息系统'],
    ['未分类', '未分类', '未分类'],
    ['搜索信息系统', '搜索信息系统', '搜索信息系统'],
    [
        '搜索业务领域分组、业务领域、业务流程',
        '搜索业务领域分组、业务领域、业务流程',
        '搜索业务领域分组、业务领域、业务流程',
    ],
    ['数据源', '数据源', '数据源'],
    ['按来源', '按来源', '按来源'],
    ['按类型', '按类型', '按类型'],
    ['搜索数据源', '搜索数据源', '搜索数据源'],
    ['全部', '全部', '全部'],
    ['搜索组织架构', '搜索组织架构', '搜索组织架构'],
    ['暂无数据', '暂无数据', '暂无数据'],
])
