import { i18n } from '@/utils'

export default i18n([
    ['取消', '取消', '取消'],
    ['保存', '保存', '保存'],
    ['请选择${text}后保存', '请选择${text}后保存', '请选择${text}后保存'],

    ['选择', '选择', '选择'],
    ['收起', '收起', '收起'],
    ['展开', '展开', '展开'],
    ['数据资源目录', '数据资源目录', '数据资源目录'],
    ['信息资源目录', '信息资源目录', '信息资源目录'],
    [
        '搜索数据资源目录名称、编码',
        '搜索数据资源目录名称、编码',
        '搜索数据资源目录名称、编码',
    ],
    ['已选（${count}）：', '已选（${count}）：', '已选（${count}）：'],
    ['自动关联', '自动关联', '自动关联'],
    ['预览', '预览', '预览'],
    [
        '抱歉，没有找到相关内容',
        '抱歉，没有找到相关内容',
        '抱歉，没有找到相关内容',
    ],
    ['暂无数据', '暂无数据', '暂无数据'],
    ['已完成全部加载', '已完成全部加载', '已完成全部加载'],
    ['不限', '不限', 'Unlimited'],
    ['类型', '類型', 'Type'],
    ['类型不限', '类型不限', '类型不限'],
])
